#include "ISUuid.h"
//-----------------------------------------------------------------------------
ISUuid::ISUuid(const QString &UID) : QString()
{
	if (!isEmpty())
	{
		clear();
	}

	QUuid Uuid(UID);
	if (!Uuid.isNull()) //Если UID не пустой после преобразования
	{
		append(Uuid.toString().toUpper());
	}
}
//-----------------------------------------------------------------------------
ISUuid::ISUuid(const QVariant &UID) : ISUuid(UID.toString())
{

}
//-----------------------------------------------------------------------------
ISUuid::ISUuid(const QUuid &UID) : QString(UID.toString())
{

}
//-----------------------------------------------------------------------------
ISUuid::ISUuid(const char *UID) : ISUuid(QString(UID))
{
	
}
//-----------------------------------------------------------------------------
ISUuid::ISUuid(const std::string &UID) : ISUuid(QString::fromStdString(UID))
{

}
//-----------------------------------------------------------------------------
ISUuid::ISUuid() : QString() //В этом конструкторе обязательно вызывать базовый конструктор (иначе будет ошибка)
{

}
//-----------------------------------------------------------------------------
ISUuid::~ISUuid()
{

}
//-----------------------------------------------------------------------------
bool ISUuid::IsValid() const
{
	return !QUuid(*this).isNull();
}
//-----------------------------------------------------------------------------
