#pragma once
#ifndef _ISALGORITHM_H_INCLUDED
#define _ISALGORITHM_H_INCLUDED
//-----------------------------------------------------------------------------
#include "iscore_global.h"
#include "StdAfx.h"
//-----------------------------------------------------------------------------
//Подавление предупреждения неиспользуемого параметра
#define IS_UNUSED(x) (void)x
//-----------------------------------------------------------------------------
namespace ISAlgorithm
{
	//! Получить путь к исполняемому файлу
	//! \return возвращает путь к испролняемому файлу
	ISCORE_EXPORT std::string GetApplicationPath();

	//! Получить путь к папке приложения
	//! \return возвращает путь к папке приложения
	ISCORE_EXPORT std::string GetApplicationDir();
}
//-----------------------------------------------------------------------------
#endif
